In [1]:
import pandas as pd

# Creating the Person table
data = {
    'id': [1, 2, 3],
    'email': ['john@example.com', 'bob@example.com', 'john@example.com']
}
person = pd.DataFrame(data)

# Display the DataFrame
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [3]:
#read from Data.xlsx

person = pd.read_excel("Data.xlsx",sheet_name = 'Day 15')
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [4]:
person.sort_values(by='id', inplace=True)
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [5]:
person.drop_duplicates(subset='email',keep = 'first',inplace = True)

In [6]:
person

   id             email
0   1  john@example.com
1   2   bob@example.com

In [7]:
import pandas as pd
import numpy as np

# Creating the Products table
data = {
    'product_id': [0, 1],
    'store1': [95, 70],
    'store2': [100, np.nan],
    'store3': [105, 80]
}
products = pd.DataFrame(data)

# Display the DataFrame
products

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [9]:
#read from Data.xlsx

products = pd.read_excel("Data.xlsx",sheet_name = 'Day 16')
products

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [11]:
 # Use the melt method to reshape the table
melted = pd.melt(products, id_vars=['product_id'], var_name='store', value_name='price')
melted

   product_id   store  price
0           0  store1   95.0
1           1  store1   70.0
2           0  store2  100.0
3           1  store2    NaN
4           0  store3  105.0
5           1  store3   80.0

In [12]:
# Drop rows where the price is null
result = melted.dropna(subset=['price'])
result

   product_id   store  price
0           0  store1   95.0
1           1  store1   70.0
2           0  store2  100.0
4           0  store3  105.0
5           1  store3   80.0